Ran Plan for 3 projects:

1. project: `demo-dev` dir: `demo-app` workspace: `dev`
1. project: `demo-stage` dir: `demo-app` workspace: `stage`
1. project: `demo-prod` dir: `demo-app` workspace: `prod`

### 1. project: `demo-dev` dir: `demo-app` workspace: `dev`
<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/template from the dependency lock file
- Reusing previous version of yandex-cloud/yandex from the dependency lock file
- Using previously-installed hashicorp/template v2.2.0
- Using previously-installed yandex-cloud/yandex v0.90.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

module.vpc.data.yandex_vpc_network.this: Reading...
module.vpc.data.yandex_vpc_network.this: Read complete after 0s [id=enp77dav1u3pidr80e1s]
module.vpc.yandex_vpc_subnet.this["0"]: Refreshing state... [id=e9b4n7ujmb40go1hccf0]
module.vpc.yandex_vpc_security_group.this["0"]: Refreshing state... [id=enphnhjpur2lh9q8llqi]
module.instances["0"].data.yandex_vpc_subnet.this: Reading...
module.instances["0"].data.yandex_compute_image.this: Reading...
module.instances["0"].data.template_file.this: Reading...
module.instances["0"].data.yandex_dns_zone.this[0]: Reading...
module.instances["0"].data.template_file.this: Read complete after 0s [id=c843d2cce905a7a6fe992e052e8963b03cbacee36ed83a554e18506b061bc8a4]
module.instances["0"].data.yandex_compute_image.this: Read complete after 0s [id=fd8gfg42q4551cvt340b]
module.instances["0"].data.yandex_dns_zone.this[0]: Read complete after 0s [id=dnsbn0rnbq0huajlta3l]
module.instances["0"].data.yandex_vpc_subnet.this: Read complete after 0s [id=e9b4n7ujmb40go1hccf0]
module.instances["0"].yandex_compute_instance.this["dev"]: Refreshing state... [id=fhmbumfln1lfj3mngtg0]
module.instances["0"].yandex_dns_recordset.this["dev"]: Refreshing state... [id=dnsbn0rnbq0huajlta3l/dev.pinbit.ru./A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.instances["0"].yandex_compute_instance.this["dev"] will be updated in-place
!   resource "yandex_compute_instance" "this" {
        id                        = "fhmbumfln1lfj3mngtg0"
        name                      = "dev"
        # (11 unchanged attributes hidden)

!       resources {
!           memory        = 4 -> 6
            # (3 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/atlantis/repos/RPotsel/demo-tf/1/dev/demo-app/demo-dev-dev.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/repos/RPotsel/demo-tf/1/dev/demo-app/demo-dev-dev.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo-dev`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.dev.pinbit.ru/lock?id=RPotsel%252Fdemo-tf%252Fdemo-app%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo-dev`
</details>
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 2. project: `demo-stage` dir: `demo-app` workspace: `stage`
<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/template from the dependency lock file
- Reusing previous version of yandex-cloud/yandex from the dependency lock file
- Using previously-installed hashicorp/template v2.2.0
- Using previously-installed yandex-cloud/yandex v0.90.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

module.vpc.data.yandex_vpc_network.this: Reading...
module.vpc.data.yandex_vpc_route_table.this[0]: Reading...
module.vpc.data.yandex_vpc_route_table.this[0]: Read complete after 0s [id=enpef49uh9e9kh8u5n3d]
module.vpc.data.yandex_vpc_network.this: Read complete after 0s [id=enp77dav1u3pidr80e1s]
module.vpc.yandex_vpc_subnet.this["0"]: Refreshing state... [id=e9bkn1ek7mmaqpvr2lui]
module.vpc.yandex_vpc_security_group.this["0"]: Refreshing state... [id=enpsffq1iishatvf3spv]
module.instances["2"].yandex_compute_instance.this["worker-stage-01"]: Refreshing state... [id=fhmigejdi7q3r8kfe310]
module.instances["1"].yandex_compute_instance.this["ingress-stage-01"]: Refreshing state... [id=fhmtnc2rduoija611cno]
module.instances["0"].yandex_compute_instance.this["control-stage-01"]: Refreshing state... [id=fhmms7je8ccqhj416dq4]
module.instances["2"].yandex_compute_instance.this["worker-stage-02"]: Refreshing state... [id=fhmk0fhfj7gsemub78hp]
module.lb["0"].yandex_lb_target_group.this: Refreshing state... [id=enpbr5luk68irlp58l10]
module.lb["0"].yandex_lb_network_load_balancer.this: Refreshing state... [id=enplf7snbl9oor9sqr87]
module.lb["0"].yandex_dns_recordset.this[0]: Refreshing state... [id=dnsbn0rnbq0huajlta3l/k8s-stage.pinbit.ru./A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.instances["0"].data.template_file.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "this" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            #cloud-config
            users:
-               name: ${username}
                groups: ${user_groups}
                shell: /bin/bash
                sudo: ['ALL=(ALL) NOPASSWD:ALL']
                lock_passwd: false
                passwd: ${password}
                ssh_authorized_keys:
-                   ${ssh_key}
            runcmd:
              - touch /var/lib/cloud/instance/warnings/.skip
        EOT
+       vars     = {
+           "password"    = ""
+           "ssh_key"     = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
            EOT
+           "user_groups" = "sudo"
+           "username"    = "ubuntu"
        }
    }

  # module.instances["0"].data.yandex_compute_image.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_compute_image" "this" {
+       created_at    = (known after apply)
+       description   = (known after apply)
+       family        = "ubuntu-2004-lts"
+       folder_id     = (known after apply)
+       id            = (known after apply)
+       image_id      = (known after apply)
+       labels        = (known after apply)
+       min_disk_size = (known after apply)
+       name          = (known after apply)
+       os_type       = (known after apply)
+       pooled        = (known after apply)
+       product_ids   = (known after apply)
+       size          = (known after apply)
+       status        = (known after apply)
    }

  # module.instances["0"].data.yandex_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_dns_zone" "this" {
+       created_at       = (known after apply)
+       description      = (known after apply)
+       dns_zone_id      = (known after apply)
+       folder_id        = (known after apply)
+       id               = (known after apply)
+       labels           = (known after apply)
+       name             = "demo-zone"
+       private_networks = (known after apply)
+       public           = (known after apply)
+       zone             = (known after apply)

+       timeouts {
+           create = (known after apply)
+           delete = (known after apply)
+           update = (known after apply)
        }
    }

  # module.instances["0"].data.yandex_vpc_subnet.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_vpc_subnet" "this" {
+       created_at     = (known after apply)
+       description    = (known after apply)
+       dhcp_options   = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "stage-a"
+       network_id     = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
+       v4_cidr_blocks = (known after apply)
+       v6_cidr_blocks = (known after apply)
+       zone           = (known after apply)
    }

  # module.instances["0"].yandex_compute_instance.this["control-stage-01"] must be replaced
-/+ resource "yandex_compute_instance" "this" {
!       created_at                = "2023-05-04T15:53:30Z" -> (known after apply)
!       folder_id                 = "b1gu9vr18o6v8qc41svt" -> (known after apply)
!       fqdn                      = "control-stage-01.ru-central1.internal" -> (known after apply)
+       gpu_cluster_id            = (known after apply)
!       id                        = "fhmms7je8ccqhj416dq4" -> (known after apply)
!       metadata                  = {
-           "serial-port-enable" = "1"
-           "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    lock_passwd: false
                    passwd: 
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
                
                runcmd:
                  - touch /var/lib/cloud/instance/warnings/.skip
            EOT
        } -> (known after apply)
        name                      = "control-stage-01"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmfhbjr1auvdru3vvfi" -> (known after apply)
!           disk_id     = "fhmfhbjr1auvdru3vvfi" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8gfg42q4551cvt340b" -> (known after apply) # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       metadata_options {
!           aws_v1_http_endpoint = 1 -> (known after apply)
!           aws_v1_http_token    = 2 -> (known after apply)
!           gce_http_endpoint    = 1 -> (known after apply)
!           gce_http_token       = 1 -> (known after apply)
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "192.168.1.34" -> (known after apply)
!           ipv6               = false -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:16:e1:e6:e4" -> (known after apply)
!           nat                = false -> (known after apply)
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
!           security_group_ids = [
-               "enpsffq1iishatvf3spv",
            ] -> (known after apply)
!           subnet_id          = "e9bkn1ek7mmaqpvr2lui" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # module.instances["1"].data.template_file.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "this" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            #cloud-config
            users:
-               name: ${username}
                groups: ${user_groups}
                shell: /bin/bash
                sudo: ['ALL=(ALL) NOPASSWD:ALL']
                lock_passwd: false
                passwd: ${password}
                ssh_authorized_keys:
-                   ${ssh_key}
            runcmd:
              - touch /var/lib/cloud/instance/warnings/.skip
        EOT
+       vars     = {
+           "password"    = ""
+           "ssh_key"     = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
            EOT
+           "user_groups" = "sudo"
+           "username"    = "ubuntu"
        }
    }

  # module.instances["1"].data.yandex_compute_image.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_compute_image" "this" {
+       created_at    = (known after apply)
+       description   = (known after apply)
+       family        = "ubuntu-2004-lts"
+       folder_id     = (known after apply)
+       id            = (known after apply)
+       image_id      = (known after apply)
+       labels        = (known after apply)
+       min_disk_size = (known after apply)
+       name          = (known after apply)
+       os_type       = (known after apply)
+       pooled        = (known after apply)
+       product_ids   = (known after apply)
+       size          = (known after apply)
+       status        = (known after apply)
    }

  # module.instances["1"].data.yandex_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_dns_zone" "this" {
+       created_at       = (known after apply)
+       description      = (known after apply)
+       dns_zone_id      = (known after apply)
+       folder_id        = (known after apply)
+       id               = (known after apply)
+       labels           = (known after apply)
+       name             = "demo-zone"
+       private_networks = (known after apply)
+       public           = (known after apply)
+       zone             = (known after apply)

+       timeouts {
+           create = (known after apply)
+           delete = (known after apply)
+           update = (known after apply)
        }
    }

  # module.instances["1"].data.yandex_vpc_subnet.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_vpc_subnet" "this" {
+       created_at     = (known after apply)
+       description    = (known after apply)
+       dhcp_options   = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "stage-a"
+       network_id     = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
+       v4_cidr_blocks = (known after apply)
+       v6_cidr_blocks = (known after apply)
+       zone           = (known after apply)
    }

  # module.instances["1"].yandex_compute_instance.this["ingress-stage-01"] must be replaced
-/+ resource "yandex_compute_instance" "this" {
!       created_at                = "2023-05-04T15:53:30Z" -> (known after apply)
!       folder_id                 = "b1gu9vr18o6v8qc41svt" -> (known after apply)
!       fqdn                      = "ingress-stage-01.ru-central1.internal" -> (known after apply)
+       gpu_cluster_id            = (known after apply)
!       id                        = "fhmtnc2rduoija611cno" -> (known after apply)
!       metadata                  = {
-           "serial-port-enable" = "1"
-           "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    lock_passwd: false
                    passwd: 
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
                
                runcmd:
                  - touch /var/lib/cloud/instance/warnings/.skip
            EOT
        } -> (known after apply)
        name                      = "ingress-stage-01"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhm1jgsp5a9en0efapua" -> (known after apply)
!           disk_id     = "fhm1jgsp5a9en0efapua" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8gfg42q4551cvt340b" -> (known after apply) # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       metadata_options {
!           aws_v1_http_endpoint = 1 -> (known after apply)
!           aws_v1_http_token    = 2 -> (known after apply)
!           gce_http_endpoint    = 1 -> (known after apply)
!           gce_http_token       = 1 -> (known after apply)
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "192.168.1.27" -> (known after apply)
!           ipv6               = false -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:1d:bb:05:b6" -> (known after apply)
!           nat                = false -> (known after apply)
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
!           security_group_ids = [
-               "enpsffq1iishatvf3spv",
            ] -> (known after apply)
!           subnet_id          = "e9bkn1ek7mmaqpvr2lui" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # module.instances["2"].data.template_file.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "this" {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = <<-EOT
            #cloud-config
            users:
-               name: ${username}
                groups: ${user_groups}
                shell: /bin/bash
                sudo: ['ALL=(ALL) NOPASSWD:ALL']
                lock_passwd: false
                passwd: ${password}
                ssh_authorized_keys:
-                   ${ssh_key}
            runcmd:
              - touch /var/lib/cloud/instance/warnings/.skip
        EOT
+       vars     = {
+           "password"    = ""
+           "ssh_key"     = <<-EOT
                ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
            EOT
+           "user_groups" = "sudo"
+           "username"    = "ubuntu"
        }
    }

  # module.instances["2"].data.yandex_compute_image.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_compute_image" "this" {
+       created_at    = (known after apply)
+       description   = (known after apply)
+       family        = "ubuntu-2004-lts"
+       folder_id     = (known after apply)
+       id            = (known after apply)
+       image_id      = (known after apply)
+       labels        = (known after apply)
+       min_disk_size = (known after apply)
+       name          = (known after apply)
+       os_type       = (known after apply)
+       pooled        = (known after apply)
+       product_ids   = (known after apply)
+       size          = (known after apply)
+       status        = (known after apply)
    }

  # module.instances["2"].data.yandex_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_dns_zone" "this" {
+       created_at       = (known after apply)
+       description      = (known after apply)
+       dns_zone_id      = (known after apply)
+       folder_id        = (known after apply)
+       id               = (known after apply)
+       labels           = (known after apply)
+       name             = "demo-zone"
+       private_networks = (known after apply)
+       public           = (known after apply)
+       zone             = (known after apply)

+       timeouts {
+           create = (known after apply)
+           delete = (known after apply)
+           update = (known after apply)
        }
    }

  # module.instances["2"].data.yandex_vpc_subnet.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_vpc_subnet" "this" {
+       created_at     = (known after apply)
+       description    = (known after apply)
+       dhcp_options   = (known after apply)
+       folder_id      = (known after apply)
+       id             = (known after apply)
+       labels         = (known after apply)
+       name           = "stage-a"
+       network_id     = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
+       v4_cidr_blocks = (known after apply)
+       v6_cidr_blocks = (known after apply)
+       zone           = (known after apply)
    }

  # module.instances["2"].yandex_compute_instance.this["worker-stage-01"] must be replaced
-/+ resource "yandex_compute_instance" "this" {
!       created_at                = "2023-05-04T15:53:29Z" -> (known after apply)
!       folder_id                 = "b1gu9vr18o6v8qc41svt" -> (known after apply)
!       fqdn                      = "worker-stage-01.ru-central1.internal" -> (known after apply)
+       gpu_cluster_id            = (known after apply)
!       id                        = "fhmigejdi7q3r8kfe310" -> (known after apply)
!       metadata                  = {
-           "serial-port-enable" = "1"
-           "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    lock_passwd: false
                    passwd: 
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
                
                runcmd:
                  - touch /var/lib/cloud/instance/warnings/.skip
            EOT
        } -> (known after apply)
        name                      = "worker-stage-01"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmdj434088vchvun4ul" -> (known after apply)
!           disk_id     = "fhmdj434088vchvun4ul" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8gfg42q4551cvt340b" -> (known after apply) # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       metadata_options {
!           aws_v1_http_endpoint = 1 -> (known after apply)
!           aws_v1_http_token    = 2 -> (known after apply)
!           gce_http_endpoint    = 1 -> (known after apply)
!           gce_http_token       = 1 -> (known after apply)
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "192.168.1.28" -> (known after apply)
!           ipv6               = false -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:12:83:a6:d9" -> (known after apply)
!           nat                = false -> (known after apply)
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
!           security_group_ids = [
-               "enpsffq1iishatvf3spv",
            ] -> (known after apply)
!           subnet_id          = "e9bkn1ek7mmaqpvr2lui" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # module.instances["2"].yandex_compute_instance.this["worker-stage-02"] must be replaced
-/+ resource "yandex_compute_instance" "this" {
!       created_at                = "2023-05-04T15:53:30Z" -> (known after apply)
!       folder_id                 = "b1gu9vr18o6v8qc41svt" -> (known after apply)
!       fqdn                      = "worker-stage-02.ru-central1.internal" -> (known after apply)
+       gpu_cluster_id            = (known after apply)
!       id                        = "fhmk0fhfj7gsemub78hp" -> (known after apply)
!       metadata                  = {
-           "serial-port-enable" = "1"
-           "user-data"          = <<-EOT
                #cloud-config
                users:
                  - name: ubuntu
                    groups: sudo
                    shell: /bin/bash
                    sudo: ['ALL=(ALL) NOPASSWD:ALL']
                    lock_passwd: false
                    passwd: 
                    ssh_authorized_keys:
                      - ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDQ3ItRqTL0EjRpDHhq1bUUjlp+cgIo+NL5r50vpM4XclKEVXBjMMZleTnLhKq2FwKuCtG6u/QPEvg5tsYBIhbC5yu1mWeJUi0LacHG6em+/kHrG+bmZLENxg7MTLDOis1yWkYcbrpJ7jEZ+GlDAGSEFHDoHubgLTrEWfdPrEQTxNCkq6CeO43Yj92EOkcWoiNw7Vl7NIy7CWaK/hqHDvEOpJM+3lRZ1aHxeHVrQ3zUBq89VpogPEOq6AUpCqFb6awwEnB4zFz19K36TIKkf0jc3Icf3gAZIX9zjzQUpSVkJ5Opv8WxYfqh1AgZ5Xcbvc1fW5Zpnt0piL48dxXAVvshLz1nMdvTFgwr2jT26wDarnqhVUBxmN2tslJ7dxkn3y0VCd3s8PzyRH8bxf0Qio1ViC6PkyHVD+q1Je0AxLj7no8HWKzNnvjVuz3r03awOzZrGdqPFsPgGddzfnDrVRDqlS8V69L4FvKCR9v7BUM2vnVzYbJfxFAuSemOkBbyYd+bRZ6mnsufnjx8RhEZ682BpIh+qfUCDiTeh5M/+BrudZiv74orq9eboloKWYMsg+atYHjBJKaGsEu+iipuY9K7hEd/65DQLc+gtCTYEY/x2I6EbqWA3zexuFVS0XOK4QdI8iGhDw3ERh/Vc+E9Nnk3vpv/05T8huZWsWDGKdZKaQ== rpotsel@gmail.com
                
                runcmd:
                  - touch /var/lib/cloud/instance/warnings/.skip
            EOT
        } -> (known after apply)
        name                      = "worker-stage-02"
+       service_account_id        = (known after apply)
!       status                    = "running" -> (known after apply)
        # (6 unchanged attributes hidden)

!       boot_disk {
!           device_name = "fhmo5r5nrto4776t5g35" -> (known after apply)
!           disk_id     = "fhmo5r5nrto4776t5g35" -> (known after apply)
!           mode        = "READ_WRITE" -> (known after apply)
            # (1 unchanged attribute hidden)

!           initialize_params {
!               block_size  = 4096 -> (known after apply)
+               description = (known after apply)
!               image_id    = "fd8gfg42q4551cvt340b" -> (known after apply) # forces replacement
+               name        = (known after apply)
+               snapshot_id = (known after apply)
                # (2 unchanged attributes hidden)
            }
        }

!       metadata_options {
!           aws_v1_http_endpoint = 1 -> (known after apply)
!           aws_v1_http_token    = 2 -> (known after apply)
!           gce_http_endpoint    = 1 -> (known after apply)
!           gce_http_token       = 1 -> (known after apply)
        }

!       network_interface {
!           index              = 0 -> (known after apply)
!           ip_address         = "192.168.1.25" -> (known after apply)
!           ipv6               = false -> (known after apply)
+           ipv6_address       = (known after apply)
!           mac_address        = "d0:0d:14:03:e2:f9" -> (known after apply)
!           nat                = false -> (known after apply)
+           nat_ip_address     = (known after apply)
+           nat_ip_version     = (known after apply)
!           security_group_ids = [
-               "enpsffq1iishatvf3spv",
            ] -> (known after apply)
!           subnet_id          = "e9bkn1ek7mmaqpvr2lui" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

!       placement_policy {
!           host_affinity_rules = [] -> (known after apply)
+           placement_group_id  = (known after apply)
        }

!       resources {
-           gpus          = 0 -> null
            # (3 unchanged attributes hidden)
        }

!       scheduling_policy {
!           preemptible = false -> (known after apply)
        }
    }

  # module.lb["0"].data.yandex_compute_instance.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_compute_instance" "this" {
+       boot_disk                 = (known after apply)
+       created_at                = (known after apply)
+       description               = (known after apply)
+       folder_id                 = (known after apply)
+       fqdn                      = (known after apply)
+       gpu_cluster_id            = (known after apply)
+       id                        = (known after apply)
+       instance_id               = (known after apply)
+       labels                    = (known after apply)
+       metadata                  = (known after apply)
+       name                      = "ingress-stage-01"
+       network_acceleration_type = (known after apply)
+       network_interface         = (known after apply)
+       platform_id               = (known after apply)
+       resources                 = (known after apply)
+       scheduling_policy         = (known after apply)
+       secondary_disk            = (known after apply)
+       service_account_id        = (known after apply)
+       status                    = (known after apply)
+       zone                      = (known after apply)
    }

  # module.lb["0"].data.yandex_dns_zone.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "yandex_dns_zone" "this" {
+       created_at       = (known after apply)
+       description      = (known after apply)
+       dns_zone_id      = (known after apply)
+       folder_id        = (known after apply)
+       id               = (known after apply)
+       labels           = (known after apply)
+       name             = "demo-zone"
+       private_networks = (known after apply)
+       public           = (known after apply)
+       zone             = (known after apply)

+       timeouts {
+           create = (known after apply)
+           delete = (known after apply)
+           update = (known after apply)
        }
    }

  # module.lb["0"].yandex_dns_recordset.this[0] must be replaced
-/+ resource "yandex_dns_recordset" "this" {
!       id      = "dnsbn0rnbq0huajlta3l/k8s-stage.pinbit.ru./A" -> (known after apply)
!       name    = "k8s-stage.pinbit.ru." -> (known after apply) # forces replacement
!       zone_id = "dnsbn0rnbq0huajlta3l" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.lb["0"].yandex_lb_target_group.this will be updated in-place
!   resource "yandex_lb_target_group" "this" {
        id         = "enpbr5luk68irlp58l10"
        name       = "k8s-stage-lb-tg"
        # (4 unchanged attributes hidden)

-       target {
-           address   = "192.168.1.27" -> null
-           subnet_id = "e9bkn1ek7mmaqpvr2lui" -> null
        }
+       target {
+           address   = (known after apply)
+           subnet_id = (known after apply)
        }
    }

  # module.vpc.yandex_vpc_security_group.this["0"] will be updated in-place
!   resource "yandex_vpc_security_group" "this" {
        id          = "enpsffq1iishatvf3spv"
!       name        = "k8s-main-sg" -> "k8s-stage-main-sg"
        # (6 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/atlantis/repos/RPotsel/demo-tf/1/stage/demo-app/demo-stage-stage.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/atlantis/repos/RPotsel/demo-tf/1/stage/demo-app/demo-stage-stage.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo-stage`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.dev.pinbit.ru/lock?id=RPotsel%252Fdemo-tf%252Fdemo-app%252Fstage)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo-stage`
</details>
Plan: 5 to add, 2 to change, 5 to destroy.

---
### 3. project: `demo-prod` dir: `demo-app` workspace: `prod`
<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of yandex-cloud/yandex from the dependency lock file
- Reusing previous version of hashicorp/template from the dependency lock file
- Using previously-installed yandex-cloud/yandex v0.90.0
- Using previously-installed hashicorp/template v2.2.0

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

module.vpc.data.yandex_vpc_route_table.this[0]: Reading...
module.vpc.data.yandex_vpc_network.this: Reading...
module.vpc.data.yandex_vpc_route_table.this[0]: Read complete after 1s [id=enpef49uh9e9kh8u5n3d]
module.vpc.data.yandex_vpc_network.this: Read complete after 1s [id=enp77dav1u3pidr80e1s]
module.vpc.yandex_vpc_subnet.this["0"]: Refreshing state... [id=e9b0nnns2dej1f7q0bui]
module.vpc.yandex_vpc_security_group.this["0"]: Refreshing state... [id=enpfnmumie7f65uot8s5]
module.instances["0"].data.yandex_dns_zone.this[0]: Reading...
module.instances["1"].data.yandex_dns_zone.this[0]: Reading...
module.instances["2"].data.yandex_dns_zone.this[0]: Reading...
module.instances["2"].data.yandex_compute_image.this: Reading...
module.instances["2"].data.template_file.this: Reading...
module.instances["2"].data.template_file.this: Read complete after 0s [id=c843d2cce905a7a6fe992e052e8963b03cbacee36ed83a554e18506b061bc8a4]
module.instances["0"].data.template_file.this: Reading...
module.instances["1"].data.yandex_compute_image.this: Reading...
module.instances["0"].data.yandex_compute_image.this: Reading...
module.instances["0"].data.template_file.this: Read complete after 0s [id=c843d2cce905a7a6fe992e052e8963b03cbacee36ed83a554e18506b061bc8a4]
module.instances["1"].data.template_file.this: Reading...
module.instances["1"].data.template_file.this: Read complete after 0s [id=c843d2cce905a7a6fe992e052e8963b03cbacee36ed83a554e18506b061bc8a4]
module.instances["0"].data.yandex_vpc_subnet.this: Reading...
module.instances["2"].data.yandex_vpc_subnet.this: Reading...
module.instances["1"].data.yandex_vpc_subnet.this: Reading...
module.instances["0"].data.yandex_compute_image.this: Read complete after 0s [id=fd8gfg42q4551cvt340b]
module.instances["2"].data.yandex_compute_image.this: Read complete after 0s [id=fd8gfg42q4551cvt340b]
module.instances["1"].data.yandex_compute_image.this: Read complete after 0s [id=fd8gfg42q4551cvt340b]
module.instances["1"].data.yandex_dns_zone.this[0]: Read complete after 0s [id=dnsbn0rnbq0huajlta3l]
module.instances["2"].data.yandex_dns_zone.this[0]: Read complete after 0s [id=dnsbn0rnbq0huajlta3l]
module.instances["0"].data.yandex_dns_zone.this[0]: Read complete after 0s [id=dnsbn0rnbq0huajlta3l]
module.instances["1"].data.yandex_vpc_subnet.this: Read complete after 0s [id=e9b0nnns2dej1f7q0bui]
module.instances["0"].data.yandex_vpc_subnet.this: Read complete after 0s [id=e9b0nnns2dej1f7q0bui]
module.instances["2"].data.yandex_vpc_subnet.this: Read complete after 0s [id=e9b0nnns2dej1f7q0bui]
module.instances["0"].yandex_compute_instance.this["control-prod-01"]: Refreshing state... [id=fhm0ohn23nm3ka233k9f]
module.instances["1"].yandex_compute_instance.this["ingress-prod-01"]: Refreshing state... [id=fhm4a965863hq8adjf0r]
module.instances["2"].yandex_compute_instance.this["worker-prod-02"]: Refreshing state... [id=fhme3c6qbd4s6gnevcrm]
module.instances["2"].yandex_compute_instance.this["worker-prod-01"]: Refreshing state... [id=fhmlcjud08far2cufqtl]
module.lb["0"].data.yandex_dns_zone.this[0]: Reading...
module.lb["0"].data.yandex_compute_instance.this[0]: Reading...
module.lb["0"].data.yandex_dns_zone.this[0]: Read complete after 0s [id=dnsbn0rnbq0huajlta3l]
module.lb["0"].data.yandex_compute_instance.this[0]: Read complete after 0s [id=fhm4a965863hq8adjf0r]
module.lb["0"].yandex_lb_target_group.this: Refreshing state... [id=enp4ijsj0c8oejelf3s9]
module.lb["0"].yandex_lb_network_load_balancer.this: Refreshing state... [id=enpceeo70aokqtliqtlu]
module.lb["0"].yandex_dns_recordset.this[0]: Refreshing state... [id=dnsbn0rnbq0huajlta3l/k8s-prod.pinbit.ru./A]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo-prod`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis.dev.pinbit.ru/lock?id=RPotsel%252Fdemo-tf%252Fdemo-app%252Fprod)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo-prod`
</details>
No changes. Your infrastructure matches the configuration.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`